package Lesson6HW;
import java.util.ArrayList;

public class Main {
    public static void main(String[] args) {

        iPeopleMethods Company = new PeopleMethods();
        Company.addUser(new People("Иван", "Иванович", "Иванов","Одесса Черемушки", 4444555522226666l,4343.44, 15436.11, 5475, 442,5533.77));
        Company.addUser(new People("Петр", "Петрович", "Петров","Киев Оболонь", 4444643299117644l,421131.6,4214.8,242,772,34633.11 ));
        Company.addUser(new People("Семен", "Семенович", "Семенов","Харьков Парк", 4444876187106834l,465212.72,11131.7,554,1165,65473.22));
        Company.addUser(new People("Николай", "Николаевич", "Николаев","Днепр Переулок", 4444870981968501l,1341.77,113214.11,6631,6311,874325.14 ));
        Company.addUser(new People("Сергей", "Сергеевич", "Сергеев","Киев Хрищатик", 4444609186940687l,7474.22,111.09,1343,12435,542.13));
        Company.addUser(new People("Василий", "Васильевич", "Васильев","Одесса Таирово", 4444657386970315l,976456.14,1354.9,1243,11134,5431.1));
        Company.addUser(new People("Анатолий", "Анатольевич", "Анатольев","Донецк Аэропорт", 4444719608017641l,7219.88,134.22,14354,63,13451.56 ));
        Company.addUser(new People("Антон", "Антонович", "Антонов","Семфирополь Артек", 4444829956819571l,6642.55,11425.6,1543,1432,87465.55 ));
        Company.addUser(new People("Роман", "Романович", "Романов","Севастополь Порт", 44445830567140085l,4513.64,1345.11,6435,2344,722.72));
        Company.addUser(new People("Федор", "Федорович", "Федоров","Львов Кофейня", 4444324567920423l,5452.22,6544.21,69,123,4322.12));
        Company.addUser(new People("Виктор", "Викторович", "Викторов","Одесса Молдованка", 4444768931657834l,3253452.33,1434.62,2563,2454,4322.11));
        Company.addUser(new People("Богдан", "Богданович", "Богданов","Карпаты Горы", 4444768903456812l,134143.34,42345.22,2456,1451,4324.11));
        Company.addUser(new People("Геннадий", "Генадьевич","Генадьев","Киев Метро", 4444674829078123l,252.62,1451.61,14514,145,5233.2));
        Company.addUser(new People("Семен", "Семенович", "Семенов","Одесса Порт", 4444134587901658l,25236.2,1451.81,525,1689,41225.1));


        //сведения об абонентах, у которых время внутригородских разговоров превышает заданное;
        Company.getUserWhoExceedTime(2000);
        //сведения об абонентах, которые пользовались междугородной связью;
        Company.getUserListWithInternational(0);

        //сведения об абонентах в алфавитном порядке.

        ArrayList<People> listOfUsers = Company.getUserByAlphabet();
        System.out.println("Список Юзеров в алфавитном порядке --->");
        for(People user : listOfUsers){
            System.out.println(user);
        }

        //сведения об первых 10 абонентов у который самый большой трафик интернета
        ArrayList<People> listofUser = Company.getInternetUsers();
        System.out.println("Список Юзеров у который самый большой трафик интернета ---->");
        for(int i = 0; i < 10;i++){
            System.out.println(listofUser.get(i));
        }
    }
}
